using System;

// Функции продолжение
//-Задача 25: Напишите цикл, который принимает на вход два натуральных числа (A и B) и возводит число A в степень B.
//- Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
//- Задача 29: Напишите программу, которая задаёт массив из 8 случайных целых чисел и выводит отсортированный по модулю массив.
//- Доп задача: На вход подаётся натуральное десятичное число. Проверьте, является ли оно палиндромом в двоичной записи.
//- Доп задача: Напишите метод, который заполняет массив случайным количеством (от 1 до 100) нулей и единиц. Размер массива должен совпадать с квадратом количества единиц в нём.
//- Доп задача: Массив на 100 элементов задаётся случайными числами от 1 до 99. Определите самый часто встречающийся элемент в массиве. Если таких элементов несколько, вывести их все.


namespace Functions
{
   internal class Program
   {
      static void Main()
      {
         Console.WriteLine("Hello World!");
      }
   }
}
